{
    "ConnectionStrings": {

        //Server=localhost\SQLEXPRESS;Database=master;Trusted_Connection=True;
        "DefaultConnection": "Server=localhost\\SQLEXPRESS;Database=odsrev2025;Integrated Security=True;Encrypt=True;TrustServerCertificate=True"
        //"DefaultConnection": "Data Source=sql220dev;Initial Catalog=OdsRev2025;Integrated Security=True;Encrypt=True;Trust Server Certificate=True"
        // Connection string for the default database connection, specifying the data source, initial catalog, and security settings.
    },
  "Logging": {
    "LogLevel": {
      "Default": "Debug",
      // Sets the default log level to Debug, which means all logs at this level and above will be captured.
      "Microsoft.AspNetCore": "Warning"
      // Sets the log level for Microsoft.AspNetCore to Warning, which means only warnings and errors will be captured for this namespace.
    }
  },
  "AllowedHosts": "*",
  // Specifies that the application can accept requests from any host.
  "CorsSettings": {
    "AllowedOrigins": [ "https://localhost:5002" ]
    // Specifies the allowed origins for CORS (Cross-Origin Resource Sharing) requests. In this case, only requests from https://localhost:5002 are allowed.
  },
  "Serilog": {
    "Using": [ "Serilog.Sinks.Console", "Serilog.Sinks.File" ],
    // Specifies the Serilog sinks to use for logging. In this case, logs will be written to the console and to files.
    "MinimumLevel": {
      "Default": "Information",
      // Sets the default minimum log level to Information, which means all logs at this level and above will be captured.
      "Override": {
        "Microsoft": "Warning",
        "System": "Warning"
        // Overrides the minimum log level for the Microsoft and System namespaces to Warning.
      }
    },
    "WriteTo": [
      {
        "Name": "Console"
        // Configures Serilog to write logs to the console.
      },
      {
        "Name": "File",
        "Args": {
          "path": "Logs/log-.txt",
          // Specifies the file path pattern for log files. The "log-.txt" pattern creates a new log file each day.
          "rollingInterval": "Day",
          // Specifies the interval for rolling log files. In this case, a new log file is created each day.
          "fileSizeLimitBytes": null,
          // Disables the file size limit to ensure only one log file is created per day.
          "outputTemplate": "{Timestamp:yyyy-MM-dd HH:mm:ss.fff zzz} [{Level}] {Message}{NewLine}{Exception}"
          // Specifies the format for log messages, including the timestamp, log level, message, and exception details.
        }
      }
    ],
    "Enrich": [ "FromLogContext" ],
    // Enriches log events with contextual information from the log context.
    "Properties": {
      "Application": "BCS.JobProcessing.Host"
      // Adds a property to all log events with the name "Application" and the value "BCS.JobProcessing.Host".
    }
  }
}